set nocount on;
use tempdb;
go
declare @yr int=2017;
declare @bg date=dateadd(yy,@yr-1900,0);
declare @fn date=dateadd(yy,1,@bg);
with
  s0 as(select nm,sf,cast(bg as date)bg,
--          lead(cast(bg as date),1,dateadd(dd,datediff(dd,0,bg)+1,0))
          lead(cast(bg as date),1,dateadd(dd,7-datediff(dd,0,bg)%7,bg))
            over(partition by nm order by cast(bg as date))xd
        from(values('Ага','20170130','Н'),('Ага','20170206','В'),
                   ('Ага','20170213','О'),('Ага','20170227','Н'),
                   ('Ага','20170306','В'),('Ага','20170313','У'),
                   ('Ага','20170320','Н'),('Ага','20170327','В'),
                   ('Урт','20170130','В'),('Урт','20170206','Н'),
                   ('Урт','20170213','В'),('Урт','20170220','Н'),
                   ('Урт','20170227','В'),
                   ('Урт','20170306','Т'),('Урт','20170313','Н'),
                   ('Урт','20170320','В'),('Урт','20170327','У'),
--                   ('Зоб','20170202','У'),('Зоб','20170227','Д'),
                   ('Вид','20170130','У'),('Вид','20170131','Б'),
                   ('Вид','20170213','Н'),('Вид','20170220','В'),
                   ('Вид','20170227','У'),
                   ('Вид','20170306','Н'),('Вид','20170313','В'),
                   ('Вид','20170320','У'),('Вид','20170327','Н'),
                   ('Маз','20170201','Н'),('Маз','20170206','В'),
                   ('Маз','20170213','У'),('Маз','20170220','Н'),
                   ('Маз','20170227','В'),
                   ('Маз','20170306','У'),('Маз','20170313','Н'),
                   ('Маз','20170320','В'),('Маз','20170327','У'),
                   ('Фок','20170201','У'),('Фок','20170206','Н'),
                   ('Фок','20170213','В'),('Фок','20170220','У'),
                   ('Фок','20170227','Н'),
                   ('Фок','20170306','В'),('Фок','20170313','У'),
                   ('Фок','20170320','Н'),('Фок','20170327','В'),
                   ('Чес','20170201','В'),('Чес','20170206','У'),
                   ('Чес','20170213','Н'),('Чес','20170220','В'),
                   ('Чес','20170227','У'),
                   ('Чес','20170306','Н'),('Чес','20170313','В'),
                   ('Чес','20170320','У'),('Чес','20170327','Н')
            )pl(nm,bg,sf)
  ),
  dd as(select dateadd(dd,row_number()over(order by(select 0))-1,@bg)d
        from master..spt_values,master..spt_values a
        order by row_number()over(order by(select 0))
          offset 0 rows fetch first datediff(dd,@bg,@fn)rows only
  ),
  yr as(select d,row_number()over(partition by year(d)order by d)ydn,
          datediff(dd,0,d)%7 wdn from dd),
  hd as(select cast(d as date)d --праздники (holidays)
        from(values('20170101'),('20170107'),('20170223'),('20170308'),
                   ('20170501'),('20170509'),('20170612'),('20171104'))h(d)
  ),
  fd as(select cast(d as date)d --нерабочие дни (free days)
        from(values('20170102'),('20170103'),('20170104'),('20170105'),
                   ('20170106'),('20170224'),('20170508'),('20171106'))f(d)
  ),
  ww as(--работа в выходные (work on weekends)
        select cast('20170211'as date)d where 1=0),
  c0 as(
    select yr.d dt,(yr.ydn-yr.wdn+6)/7+(yr.ydn-yr.wdn+6)%7/4 wn,yr.wdn,w.d wd,
      iif(hd.d is not null,
          'пр',iif(fd.d is not null,
                   'вх',iif(yr.wdn<5 or ww.d is not null,'рд','вх')))td
    from yr join(values('пн',0),('вт',1),('ср',2),('чт',3),('пт',4),('сб',5),
                       ('вс',6))w(d,dn)on yr.wdn=w.dn left join hd on yr.d=hd.d
    left join fd on yr.d=fd.d left join ww on yr.d=ww.d
  ),
  c1 as(select *,lead(td,1,'пр')over(order by dt)tw,
                 lag(td)over(order by dt)yd from c0),
  cd as(
    select c1.dt,c1.wn,c1.wdn,c1.wd,iif(c1.td='рд',yt.td,c1.td)td
    from(values('','вх','р1'),('','пр','п1'),('','рд','пн'),
               ('рд','вх','пт'),('рд','пр','пп'),('рд','рд','рд'))yt(yd,tw,td)
    right join c1 on((c1.yd!='рд'and yt.yd='')or yt.yd=c1.yd)and yt.tw=c1.tw
  ),
  wp as(select * --режимы рабочего времени (working patterns)
        from(values('Н','пн','0:0','4:0','4:30','7:30'),
                   ('Н','пн','23:45','','','24:0'),
                   ('Н','рд','0:0','4:0','4:30','7:15'),
                   ('Н','рд','23:45','','','24:0'),
                   ('Н','пт','0:0','4:0','4:30','7:15'),
                   ('Н','р1','0:0','4:0','4:30','7:30'),
                   ('Н','пп','0:0','4:0','4:30','6:15'),
                   ('Н','п1','0:0','4:0','4:30','6:30'),
                   ('У','пн','7:0','11:55','12:40','15:45'),
                   ('У','рд','7:0','11:55','12:40','15:45'),
                   ('У','пт','7:0','11:55','12:40','15:45'),
                   ('У','р1','7:0','11:55','12:40','15:45'),
                   ('У','пп','7:0','11:55','12:40','14:45'),
                   ('У','п1','7:0','11:55','12:40','14:45'),
                   ('В','пн','15:30','19:30','20:0','24:0'),
                   ('В','рд','15:30','19:30','20:0','24:0'),
                   ('В','пт','15:30','19:30','20:0','24:0'),
                   ('В','р1','15:30','19:30','20:0','24:0'),
                   ('В','пп','15:30','19:30','20:0','23:0'),
                   ('В','п1','15:30','19:30','20:0','23:0')
            )w(sf,td,bg,lbg,lfn,fn)
  ),
  sf as(select s0.nm,s0.sf,cd.wn,cd.dt,cd.wd,cd.td,
          coalesce(wp.bg,'')bg,coalesce(wp.lbg,'')lbg,
          coalesce(wp.lfn,'')lfn,coalesce(wp.fn,'')fn
        from cd join s0 on cd.dt>=s0.bg and cd.dt<s0.xd
        left join wp on s0.sf=wp.sf and cd.td=wp.td
  )
select nm,sf,wn,convert(char,dt,104)dt,wd,td,bg,lbg,lfn,fn
from sf where nm='Чес' and dt>='20170301' and dt<'20170401'
order by nm,sf.dt,cast(bg as time(0));